app/controllers/api/v1/classrooms_controller.rb

SELECT  "teachers".* FROM "teachers" WHERE "teachers"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
      def index
        teacher = Teacher.find params[:teacher_id]

SELECT  "teachers".* FROM "teachers" WHERE "teachers"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "classrooms" ("school", "slug", "code", "teacher_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["school", "Anhembi Morumbi"], ["slug", "VON09"], ["code", "A3321"], ["teacher_id", 1]]
---
      def create
        teacher = Teacher.find params[:teacher_id]
        @classroom = teacher.classrooms.new(classroom_params)
        generate_code

        if @classroom.save

SELECT  "classrooms".* FROM "classrooms" WHERE "classrooms"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
      def load_classroom
        @classroom = Classroom.find_by_id params[:id]