app/controllers/api/v1/questions_controller.rb

      def answer
        student = Student.find_by_id params[:student_id]
        if student.present? && params[:question_id].present? && params[:answer].present?
          create_answer = ExamQuestion.new(exam: student.exam, question_id: params[:question_id], answer: params[:answer])
          create_answer.save
---
SELECT  "students".* FROM "students" WHERE "students"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
INSERT INTO "exam_questions" ("answer", "exam_id", "question_id") VALUES ($1, $2, $3) RETURNING "id"  [["answer", 1], ["exam_id", 2], ["question_id", 2]]
INSERT INTO "exams" ("student_id") VALUES ($1) RETURNING "id"  [["student_id", 3]]