app/controllers/api/v1/sessions_controller.rb

SELECT  "teachers".* FROM "teachers" WHERE "teachers"."email" = $1 LIMIT $2  [["email", "vinicius@loldesign.com.br"], ["LIMIT", 1]]
SELECT  "teachers".* FROM "teachers" ORDER BY "teachers"."id" DESC LIMIT $1  [["LIMIT", 1]]
---
		  def create
		  	resource = Teacher.find_by_email params[:email]
		  	if resource.present? && resource.valid_password?(params[:password])