app/controllers/api/v1/students_controller.rb

INSERT INTO "students" ("name", "classroom_id") VALUES ($1, $2) RETURNING "id"  [["name", "Marcia Mamute"], ["classroom_id", 4]]
---
      def create
        @student = @classroom.students.new(student_params)

        if @student.save && @student.build_exam.save

SELECT  "students".* FROM "students" WHERE "students"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
      def load_student
        @student = Student.find_by_id params[:student_id]

SELECT  "classrooms".* FROM "classrooms" WHERE "classrooms"."code" = $1 LIMIT $2  [["code", "A33 MARCIA BIXA"], ["LIMIT", 1]]
---
      def find_class_room
        @classroom = params[:classroom_id].present? ? Classroom.find_by_id(params[:classroom_id]) :  Classroom.find_by_code(params[:code])