app/controllers/login_controller.rb

SELECT  "teachers".* FROM "teachers" WHERE "teachers"."email" = $1 LIMIT $2  [["email", "sda@lol.com.br"], ["LIMIT", 1]]
---
  def index
  	resource = Teacher.find_by_email params[:username]